In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\admin\anaconda3\envs\madeshwaranbscb\lib\site-packages (1.5.3)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: pytz>=2020.1 in c:\users\admin\anaconda3\envs\madeshwaranbscb\lib\site-packages (from pandas) (2022.7.1)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\admin\anaconda3\envs\madeshwaranbscb\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.20.3 in c:\users\admin\anaconda3\envs\madeshwaranbscb\lib\site-packages (from pandas) (1.24.2)
Requirement already satisfied: six>=1.5 in c:\users\admin\anaconda3\envs\madeshwaranbscb\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [47]:
import pandas as pd
#to use to creat a data frame

In [6]:
a=pd.Series(['one',2,3,4,5],index=[1,2,3,4,5])

In [7]:
a

1    one
2      2
3      3
4      4
5      5
dtype: object

In [15]:
A=pd.Series(['mass','nandy','mani','sriram'],index=[1,2,3,4])

In [16]:
A

1      mass
2     nandy
3      mani
4    sriram
dtype: object

In [23]:
season={"summer":{1:'jan',2:'feb',3:'mar',4:'apr'},"winter":{1:'may',2:'jun',3:'jul',4:'aug'}}

In [24]:
season

{'summer': {1: 'jan', 2: 'feb', 3: 'mar', 4: 'apr'},
 'winter': {1: 'may', 2: 'jun', 3: 'jul', 4: 'aug'}}

In [26]:
d=pd.DataFrame(season,columns=["summer","winter"])

In [27]:
d

  summer winter
1    jan    may
2    feb    jun
3    mar    jul
4    apr    aug

In [34]:
import numpy as np

In [37]:
a=pd.DataFrame(np.random.randint(10,500,size=(10,5)),columns=list('abcde'))

In [38]:
a

     a    b    c    d    e
0   94   88   85   22   41
1  414  320  325  355  136
2  251  130  375   14  439
3   52  423  284   12  300
4  477  262  197  395   42
5   21   81   70  277   93
6  368  426  170  292   57
7  236  411  329  497  131
8  332   69  315  279  183
9  423  467  336  295  129

In [42]:
a.to_csv('C:\\Users\\ADMIN\\Documents\\madeshwaran.R\\pandas.csv')
#to store data in exel

In [45]:
d=pd.read_csv('C:\\Users\\ADMIN\\Documents\\madeshwaran.R\\pandas.csv')
#to read the data

In [46]:
print(d)

   Unnamed: 0    a    b    c    d    e
0           0   94   88   85   22   41
1           1  414  320  325  355  136
2           2  251  130  375   14  439
3           3   52  423  284   12  300
4           4  477  262  197  395   42
5           5   21   81   70  277   93
6           6  368  426  170  292   57
7           7  236  411  329  497  131
8           8  332   69  315  279  183
9           9  423  467  336  295  129

In [55]:
n=d.drop("Unnamed: 0",axis=1)

In [56]:
n.drop("e",axis=1)

     a    b    c    d
0   94   88   85   22
1  414  320  325  355
2  251  130  375   14
3   52  423  284   12
4  477  262  197  395
5   21   81   70  277
6  368  426  170  292
7  236  411  329  497
8  332   69  315  279
9  423  467  336  295

In [57]:
n.shape

(10, 5)

In [58]:
n.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       10 non-null     int64
 1   b       10 non-null     int64
 2   c       10 non-null     int64
 3   d       10 non-null     int64
 4   e       10 non-null     int64
dtypes: int64(5)
memory usage: 528.0 bytes